      ******************************************************************
      * Author     : ALDV
      * Date       : 28 MAY 2018
      * Purpose    : MOSTRAR MENSAJE
      * Company    : ETG-BBVA
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. QG1CX001.
      * DATA DIVISION.
      * FILE SECTION.
      * WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       0000.
            DISPLAY "ARQUITECTURA DE SERVICIOS - ASO - ALTAMIRA"
            STOP RUN.
       END PROGRAM QG1CX001.
